[{"i":1,"d":"feb 12th 2013","e":"The Green Ruby News was at the beginning an internal letter I was publishing every week in Code Green IT company. But it became obvious that this could and should be shared outside our walls, so here is it. Green Ruby Newsletter goes public ! <br><br>The purpose of this letter is to spread the information we gathered during the week, about ruby, rails, javascript, web development, or internet in general. I hope you can find any interest in that.","c":null},{"i":2,"d":"feb 16th 2013","e":"This second edition is an occasion to tune up a bit the mailchimp templates, and make the letter readable on phones. Well, it was chinese new year hollidays so I got plenty of time and wanted to add more rubyconf dates. Damn there are so many. I will keep a record at the bottom of each letter, so people can get organized in advance.","c":null},{"i":3,"d":"feb 23th 2013","e":"On February 24th, Ruby languages celebrates its 20 years birthday. Woohoo! Have a drink in honor to Matz. Here are some links of ruby/webdev content that appeared last week.","c":null},{"i":4,"d":"mar 2nd 2013","e":"The ruby 2.0 release last week triggered a lot of other releases, with rubygems 2.0, passenger, rails, rspec, devise, rack, hobo, and many others. There is also some a rush on pull requests on ruby projects as people jump on ruby 2 and fix compatibilities issues on the way. A very interesting week.","c":null},{"i":5,"d":"mar 09th 2013","e":"Here are your weekly news about ruby, the universe and everything (according tothe current scope). I'm preparing a dedicated website to organize the collective writing of this newsletter, more news about it very soon.","c":null},{"i":6,"d":"mar 17th 2013","e":"We got a new space online for our newsletter, have a look at http://greenruby.org. A more collaborative website is in preparation and this simple page will evolve very soon","c":null},{"i":7,"d":"mar 23th 2013","e":"Ah yet another rails upgrade! And this one looks problematic so we may get yet another one next week. While upgrading each time, just try focusing on how secure rails is becoming with all that fuss. Btw, if you get any news in non english that make a reference in your local area, feel free to share I will be happy to include it. It's a matter of ambiance, I just like it multi-cultural :)","c":null},{"i":8,"d":"mar 30th 2013","e":"If you look for some design inspiration you should go have a look at the <a href=\"http://www.awwwards.com/css-gallery\">2013 awwwards nominees list</a>, there is a damn lot of really great design out there. But if you are more into technical aspects of web development, read on, there is a lot for you just below.","c":null},{"i":9,"d":"apr 06th 2013","e":"<a href=\"http://www.awwwards.com/css-gallery\">awwwards</a> link last week was pretty popular and for the less technical of our subscribers, here is a nice reading: <a href=\"http://elouwebdesign.com/designing-for-humans\">Design for humans</a> and I also can point out that last week began a free course on coursera about <a href=\"https://www.coursera.org/course/gamification\">gamification</a> (it just began it's still time to catch up). I think that from now on I will include some non-technical links in the edito.","c":null},{"i":10,"d":"apr 13th 2013","e":"This is the 10th edition of this newsletter. This is a digit rotation and in the species of newsletters it's the exit from childhood. Woohoo. Here is a special note for the web geeks in Taiwan : <a href=\"http://registrano.com/events/jsdc2013\">the registration</a> for <a href=\"http://jsdc.tw\">JSDC</a> open this monday at 11 am, be quick usually it's full in one or 2 hours.","c":null},{"i":11,"d":"apr 21th 2013","e":"Hey btw, feel free to send us your news, links, discoveries for fresh content to <a href=\"mailto:news@greenruby.org\">news@greenruby.org</a> (yeah this is a very short edito, isn't it ?)","c":null},{"i":12,"d":"apr 28th 2013","e":"The big Rubyconf starts tomorrow, I bet we will have a bunch of nice video to watch, for the majhority of us that don't go there. This week we had already a bunch of Confreaks videos from recent conferences. For the more visual of us, have a look at GoodUI <a href=\"http://www.goodui.org/\">http://www.goodui.org/</a>, a Year of icons <a href=\"http://sensibleworld.com/news/year-of-icons/\">http://sensibleworld.com/news/year-of-icons/</a>, Gamification News <a href\"http://www.gamification.co\">http://www.gamification.co</a>, Flat icons examples <a href\"http://designmodo.com/flat-icons-examples/\">http://designmodo.com/flat-icons-examples</a>, Pinterest 2013 flat design trends <a href=\"http://pinterest.com/JRMYLFBV/web-modern-ui-flat-design-2013-trends/\">http://pinterest.com/JRMYLFBV/web-modern-ui-flat-design-2013-trends</a> and I suspect I should have a section for that kind of eye sweeties, maybe?","c":null},{"i":13,"d":"may 5th 2013","e":"This week I worked a little more on the <a href=\"https://github.com/mose/greeby\">greeby</a> project, that should help me in the writing of this newsletter. I spent lot of time exploring sinatra, mongo, and ember.js. A lot of fun, but it's not ready yet. So I made a <a href=\"https://github.com/mose/greeby/blob/master/lib/tasks/generate_task.rb\">rake task</a> for the generation in the while. You can check what's planned (and participate) on the <a href=\"https://trello.com/board/greeby-platform/513fd48aa7ed906115001a04\">taskboard on Trello</a>.","c":null},{"i":14,"d":"may 12th 2013","e":"Here are some news from the front. I'm still working on the Green Ruby website, but in the same move I'm improving the layout of the letter. This week we get icons per category of content.","c":null},{"i":15,"d":"may 19th 2013","e":"Last letter was a bit wrong, too heavy. So I'm refining and simplifying the design a bit, and the 'join' section now will move to the website. Maybe if there is any request I could setup a different mailing for it.","c":null},{"i":16,"d":"may 26th 2013","e":"Here is it, there is a new website on <a href=\"http://greenruby.org\">http://greenruby.org</a>. It is a static website generated with a small rakefile and grunt, the ember version of it is still under development.","c":null},{"i":17,"d":"jun 2nd 2013","e":"Last week there was a lot of activity with conferences with rubykaigi, fluentconf, jsconf. There are many videos to catch up with.","c":null},{"i":18,"d":"jun 9th 2013","e":"This week I'm going to totally change the order of the sections, following some feedbacks I had about the interests of our readers.","c":null},{"i":19,"d":"jun 16th 2013","e":"There is so much noise about iOs7, it's hard to avoid referring to it a bit. But hopefully there is other news, like the new <a href=\"http://www.ruby-lang.org/en/news/2013/06/12/new-ruby-lang-org-released/\">Ruby-lang</a> website, now collaborative via github.","c":null},{"i":20,"d":"jun 22th 2013","e":"There is a background noise recently about the return of big brother, prism, etc in many topics I parsed for this letter. Kinda scary. But here we only are interested by toys and tools, so let's be light headed and check out the stuff of this week.","c":null},{"i":21,"d":"jun 30th 2013","e":"This week we had a final release on rails 4.0, a security release of ruby 1.9.3 and 2.0.0, and the retirement of ruby 1.8.7.","c":null},{"i":22,"d":"jul 7th 2013","e":"There is some activity happening for Green Ruby on <a href=\"http://github.com/greenruby\">github</a>. We are preparing a collaborative newsroom or something like that. Feel free to jump in if you feel like (the channel #greenruby on freenode is always open).","c":null},{"i":23,"d":"jul 14th 2013","e":"This week edito is going to be a geek quote: \"I would love to change the world, but they won't give me the source code\". Let's take 42 seconds to meditate about it.","c":null},{"i":24,"d":"jul 21th 2013","e":"There was a need for that new section 'Look' for a while. I always have links to interesting UI and never know where to put them.","c":null},{"i":25,"d":"jul 28th 2013","e":"Hmm I didn't have much time this week for the gathering, as I'm busy changing job right now. But behind the scene we are working on preparing a tool for semi-automating the gathering process (well, Dale is the active guy there for now). Have a look at <a href=\"http://github.com/greenruby/organews\">organews</a> if you are curious and want to jump in.","c":null},{"i":26,"d":"aug 4th 2013","e":"This week I changed job and also my hat. I became a fulltime system administrator. It may have some consequences on the green ruby publication, because I am switching gears. Hopefully we will have a more contributive platform very soon. But in the while, feel free to send me links to help compensate. On another hand, I'm thinking about making a new publication about devops. It's just because I use publication as a way to self-hack myself into more structured organization of my awareness of what happens around. Like a public bookmarking, in some ways. More news about it next week...","c":null},{"i":27,"d":"aug 11th 2013","e":"Here is another weekly bunch of links. Just so you know, there is only 55 subscribers so it's very confidential. But as I was telling a friend recently, even with no subscribers I would keep track of links that way anyways. So why not reach the extra yard to make it sharable? And actually, if I had too much mails to sent I would have to pay mailchimp. I'm so much totally not into business! And thanks Xenor for the weekly links he sends me. Feel free to also contribute if you have some links you want to promote.","c":null},{"i":28,"d":"aug 19th 2013","e":"I'm a bit late this week I was busy this week-end travelling to Hong-Kong with a tribe of geeks. Quite fun, but I'm happy to be back in Taipei :)","c":null},{"i":29,"d":"aug 25th 2013","e":"This week there is a lot of videos from Lone Star and Steel City. Also, I give at the very end a list of many podcasts, not really related to ruby, but can be of interest.","c":null},{"i":30,"d":"sep 1st 2013","e":"The edito is, this time, totally irrelevant and really pertinent at the same time.","c":null},{"i":31,"d":"sep 8th 2013","e":"Hey there. Well this new job I got is not letting me much time to work on the automation of this information gathering. But I will keep the weekly publication fluid. This is still a very manual process. If ever you do have interesting fresh links of the week, please consider dropping me a mail! (mose at greenruby.org)","c":null},{"i":32,"d":"sep 15th 2013","e":"As announced previously, there is more and more devops thing in my scope. Not much posts this week, but a bunch of podcasts. Docker and go are really good fun. Hey I still love ruby, but golang recently got a lot of my attention.","c":null},{"i":33,"d":"sep 22th 2013","e":"The fresh links of the week.","c":null},{"i":34,"d":"sep 29th 2013","e":"A lot of learning links this week. And also a bunch of news, about ruby 2.1, google analytics dropping ie8 support, plus the usual cocktail of links. There is also some non-webdev links related to topics that I just like to spread around, like go or arduino-like toys).","c":null},{"i":35,"d":"oct 6th 2013","e":"There is plenty of links again this week. Enjoy.","c":null},{"i":36,"d":"oct 14th 2013","e":"The registration for this year Rails Runble <a href=\"http://blog.railsrumble.com/2013/10/07/registration-has-opened/\">has opened</a> on oct 07 and ended yesterday. But you can follow the fun that begins next weekend (oct 19). For the rest, I'm looking for a icon for devops topic. Feels free to send suggestions.","c":null},{"i":37,"d":"oct 20th 2013","e":"Last week I played a bit with <a href=\"http://cartodb.com\">cartodb</a> to make a <a href=\"http://cdb.io/GZM0Bv\">map or subscribers</a> from the csv export from mailchimp. The result is pretty neat. About the news, this week we get a lot of links to the recent ruby and rails confs, and a lot of more things.","c":null},{"i":38,"d":"oct 27th 2013","e":"Last week I had some problems with my podcast client for android,. So I got back to gPodder and found out Listen-up. This app that is really neat. You can check my <a href=\"https://gpodder.net/user/mose/subscriptions\">gPodder listing</a>.","c":null},{"i":39,"d":"nov 3rd 2013","e":"This week we get the rails upgrade to 4.0.1 with a lot of bugfixes. And there is like each week a collection of other links.","c":null},{"i":40,"d":"nov 10th 2013","e":"Hey btw if you want to have a chat you always can jump on @greenruby on irc.freenode.net. Xenor and I are sitting there the whole day. This week you may notice a little change in the category icons.","c":null},{"i":41,"d":"nov 17th 2013","e":"We don't have many new videos this week, but there are a bunch of articles. You also can check out the project of <a href=\"http://aaronswartzthedocumentary.com/\">documentary about aaron</a> or the <a href=\"https://flynn.io/blog/demo-roadmap\">progress of flynn</a>.","c":null},{"i":42,"d":"nov 24th 2013","e":"42. Here we are. This memetic number marks an accomplishement in itself. Well, be sure to upgrade your ruby for the occasion, and if you still run 1.8, hum, you are screwed (unless you are on heroku, they patched their version).","c":null},{"i":43,"d":"dec 01st 2013","e":"It's harder and harder to keep this letter to a decent size, there are so many things happening each week. And I confess I like to keep the topics a bit wider than just ruby or webdev. My bad. But I wonder, what you readers think about it ? Feels free to just hit reply on this mail and share your thoughts.","c":null},{"i":44,"d":"dec 08th 2013","e":"This week on tuesday we had various security alerts on rails, all versions. It's a good time to upgrade or to think about how to get rid of your rails 2 remaining apps. I know there are still a lot out there.","c":null},{"i":45,"d":"dec 15th 2013","e":"The glass is neither half-full nor half-empty: it's just twice as big as it needs to be.<br> (just an unknown geek quote).","c":null},{"i":46,"d":"dec 22th 2013","e":"Now there are 100 subscribers to this newsletter, from 28 different countries. Nothing compared to the other publishers out there, but I have no time and interest in promotion. After all this weekly mail was just intended to be sent to a dozen of friends. And it went on like a personal habit, forcing me to keep in touch with the flow. Anyways, if I don't know you and if you like it, I'm happy enough. (and xenor is too). Happy hollidays if you get any!","c":null},{"i":47,"d":"dec 29th 2013","e":"This week podcasters are in holidays, but ruby is not, here is v2.1 coming out. And various other notable releases visibly wanted to get out before 2014. All good for us :) See you next year!","c":null},{"i":48,"d":"jan 5th 2014","e":"Okay there is a new year digit, let's get back to work now. And btw feel free to visit us on #greenruby on freenode.","c":null},{"i":49,"d":"jan 12th 2014","e":"As we are approaching the first year of publication of this newsletter, it's time to think about the birthday party. It should happen in Taipei, Taiwan, after chinese new year. If you want to join, or know a good place where we could gather, feel free to <a href=\"mailto:news@greenruby.org\">drop me a mail</a>.","c":null},{"i":50,"d":"jan 19th 2014","e":"In 2 weeks there is the <a href=\"https://geekli.st/hackathon/52c49d837689332d5f000019\">5th geeklist world-wide hackacthon</a>, maybe you are interested in joining and/or suggesting projects, that can be fun.","c":null},{"i":51,"d":"jan 26th 2014","e":"Next week it's chinese new year here in Taipei. During that holiday, I plan to secretly work on a dynamic version of Green Ruby website where we can filter and search links by tags or title. There may also be some redesign involved. But shht, it's secret and not even sure it will pan out.","c":null},{"i":52,"d":"feb 2nd 2014","e":"This is the one-year last edition. For the occasion I revived the publications 001 to 012 from my archives. They are now available on the website. I was sortof surprised that some links are still very valuable. And if all goes well the new website will be ready next week.","c":null},{"i":53,"d":"feb 9nd 2014","e":"Here is the first edition of the Year of the Horse. As previously announced the website is going under a big rewriting which only impacts the design for now, but there is some angularization preparing behind the scene. In the while, go fix your libyaml.","c":null},{"i":54,"d":"feb 16th 2014","e":"Argh the subscription form was broken last week after the layout upgrade on <a href=\"http://greenruby.org\">http://greenruby.org</a>. It's fixed now. The v2 of the website is still cooking.","c":null},{"i":55,"d":"feb 23th 2014","e":"This week is mostly obscured by the disappearance of <a href=\"http://en.wikipedia.org/wiki/Jim_Weirich\">Jim Weirich</a>, and his <a href=\"https://github.com/jimweirich/wyriki/commit/d28fac7f18aeacb00d8ad3460a0a5a901617c2d4\">last commit comments flow</a> is a small sign of his impact in the ruby community.","c":null},{"i":56,"d":"mar 2nd 2014","e":"This week big news is the 21th birthday for ruby, with some new releases for each branch. Check the <a href=\"http://svn.ruby-lang.org/repos/ruby/tags/v2_1_1/ChangeLog\">changelog for ruby 2.1.1</a> it's pretty massive.","c":null},{"i":57,"d":"mar 9th 2014","e":"If debugging is the process of removing bugs, then programming must be the process of putting them in. // Edsger Dijkstra.","c":null},{"i":58,"d":"mar 16th 2014","e":"This week I opened a <a href=\"https://www.facebook.com/pages/Green-Ruby/1413063455616628\">facebook</a> page and a <a href=\"https://plus.google.com/103851980502956488088\">google+</a> too, in more than the <a href=\"http://twitter.com/greenrubist\">twitter</a> account. Not that I'm really into it but I wanted to try bufferapp, which is pretty neat. So you can check links there during the week. Also note that there may be more links in those feeds than in the newsletter, and the newsletter has links that are not in the feed.","c":null},{"i":59,"d":"mar 23th 2014","e":"There is some intense turmoil in Taiwan right now. Got busy following <a href=\"http://g0v.today\">g0v.today</a> and I'm amazed by the level of organization displayed both by protesters and by the geek community. A real lesson of activism.","c":null},{"i":60,"d":"mar 30th 2014","e":"Fresh links of the week. Well yes sometimes it's not that easy to write an edito.","c":null},{"i":61,"d":"apr 6th 2014","e":"This month on 25th there is a <a href=\"http://rubyconf.tw/2014/\">rubyconf in Taipei</a>, so I prepared simple <a href=\"http://greenruby.org/img/grn-sticker.png\">stickers</a> because geeks like to stick stuff on their laptops. If you want some, just come there, or <a href=\"mailto:mose@greenruby.org\">send me a mail</a> see if I can send you a bunch of them.<br>Side Note: There is no stupid april's fool joke in this edition (pfew).","c":null},{"i":62,"d":"apr 13th 2014","e":"The week of the <a href=\"http://heartbleed.com/\">bleeding heart</a> was busy with server upgrades. ruby recompilation, SSL renewals, passwords and keys rotations. There are so many posts about it this week.","c":null},{"i":63,"d":"apr 19th 2014","e":"On friday I will get to <a href=\"http://rubyconf.tw/2014/\">RubyConf Taiwan</a> and will spread some Green Ruby stickers. I sent some last week and can send some more. If you would like to have some just <a href=\"mailto:mose@greenruby.org\">contact me</a>. Another notable event this week was the release of ubuntu 14.04, I installed the gnome version on my desktop and it's running pretty well.","c":null},{"i":64,"d":"apr 27th 2014","e":"That's a busy weekend for us, RubyConf taiwan just ended, <a href=\"https://twitter.com/search?q=rubyconftw&mode=photos\">check some photos</a>. RailsConf 2014 happened at the same time and confreaks published videos on justin.tv (see below). And else in the world, here are the geeky news of the week.","c":null},{"i":65,"d":"may 4th 2014","e":"Hey if you know rails and are between jobs, why not come to Taiwan teach a few months ? Check this <a href=\"https://dl.dropboxusercontent.com/u/56565651/ACamp%20RoR%20Instructor.pdf\">announce (pdf)</a>, this may be the occasion (it's paid and hosted).","c":null},{"i":66,"d":"may 11th 2014","e":"A lot of new releases this week, both on ruby, and on rails, but also various others. We also have a lot of podcasts at the bottom too.","c":null},{"i":67,"d":"may 18th 2014","e":"This week may be a good time to book your ticket for <a href=\"http://www.reddotrubyconf.com/\">RedDot rubyconf</a> in Singapore, it's not full yet. For the rest, here is our weekly list of links, now sent to 250 subscribers in 45 different countries (I updated the <a href=\"http://cdb.io/1fRC0tQ\">map</a> last week).","c":null},{"i":68,"d":"may 25th 2014","e":"Testing is a hot topic recently in the rails community. Reminds me of <a href=\"https://twitter.com/bloerwald/status/448415935926255618/photo/1\">this image</a>. But to tell you the truth, I'm not gonna stop unit testing, even if it's not enough. So, what is new this week? As usual, a bunch of things.","c":null},{"i":69,"d":"jun 1st 2014","e":"Last week I officially launched at Faria, my current employer, a public tips website called <a href=\"http://devtips.faria.co\">Faria Dev Tips</a>. I has a lot in common with Green Ruby. The topics covered are the same, it covers rails, ruby, js, devops, design, css, with the same fullstack approach. The origin of it is also very similar. Both come from internal communication and evolve to open sharing. Check it out, you may like it :)","c":null},{"i":70,"d":"jun 8th 2014","e":"This week I'm adding at the very bottom the <a href=\"http://devtips.faria.co\">devtips</a> of the week. I had some positive feedback about them. So adding quick links may be of interest because they cover the same fullstack webdev topics as this newsletter.","c":null},{"i":71,"d":"jun 15th 2014","e":"This week I began to publish the links to the resources I use in my weekly review. So checkout the <a href=\"http://greenruby.org/links.html\">links</a> page on the website if you are interested.","c":null},{"i":72,"d":"jun 22th 2014","e":"As a reminder, I still have a bunch of stickers, feel free to <a href=\"mailto:news@greenruby.org\">ask</a> for some if you want them. And if you like stickers, you also may want to get <a href=\"http://www.redbubble.com/people/skulioskarsson/works/10590498-ruby\">that one</a>, which is pretty neat.","c":null},{"i":73,"d":"jun 29th 2014","e":"One more week of links gathering, here is the summer collection of what you should know about. Well, there is much more if you look further (keep an eye on our <a href=\"http://greenruby.org/links.html\">links</a>). Enjoy!","c":null},{"i":74,"d":"jul 6th 2014","e":"This week we had a rails upgrade for security (but only concerns postgres) and another one immediately for fixing a regression in the security fix. It happens sometimes. But there is so much more happening all around. It's very hard to compose this letter because I have to pick news from such a massive amount of new things. But here it is, enjoy :)","c":null},{"i":75,"d":"jul 13th 2014","e":"Ok I will not say a word about football (yes I just did, I know) because xenor and me have opposite positions on this topic. On a more on-topic subject, if you can go to Japan this fall, registration to <a href=\"http://rubykaigi.doorkeeper.jp/events/12215\">RubyKaigi</a> opened last week.","c":null},{"i":76,"d":"jul 20th 2014","e":"This week, on jul 25th, Ruby on Rails will have 10 years. And it will also be the annual <a href=\"http://sysadminday.com/\">Sysadmin appreciation day</a>. It will be a busy friday.","c":null},{"i":77,"d":"jul 27th 2014","e":"For those that live in Taiwan (or plan to pay us a visit on this amazingly geeky island) note in your calendar the <a href=\"http://railspacific.com/\">Rails Pacific</a> conference in september. Also, I hope you hugged your favorite sysadmin on friday. Puppetlab organized a <a href=\"http://puppetlabs.com/gif-contest/sysadmin-appreciation-day-2014\">gif contest</a> on the topic, but I really prefer the gifs from <a href=\"http://devopsreactions.tumblr.com/\">DevOps reactions</a>. (and yeah, the sysadminday website went down on sysadmin day, pretty ironically).","c":null},{"i":78,"d":"aug 3rd 2014","e":"This week <a href=\"https://www.airpair.com/airconf2014\">Airconf</a> begins. It's an interesting remote conference about remote pairing, collaboration, and various technical topics. It lasts 4 weeks during august. Be sure to check it out. ","c":null},{"i":79,"d":"aug 10th 2014","e":"As maybe you know that's a long time I wish to make the green ruby website dynamic, especially to feature a search engine on all the links. But I never found time yet. So if you feel like contributing, please to <a href=\"mailto:news@greenruby.org\">contact me</a>. Ideally I would think about some pre-generated json db and a js only frontend, so then there is no need for a backend. The source code of the current static site and generation scripts is <a href=\"https://github.com/greenruby/grn-static\">on github</a>","c":null},{"i":80,"d":"aug 17th 2014","e":"Btw did you know I keep a collection of subreddit to watch ? It's on <a href=\"http://www.reddit.com/user/ozmose/m/greenruby\">http://www.reddit.com/user/ozmose/m/greenruby</a>.","c":null},{"i":81,"d":"aug 24th 2014","e":"Hmm I really don't like my icons. I added categories from time to time and got some random icon to match them. Now I look at the result and I don't like it. Maybe someone can suggest a collection that could match the Green Ruby categories collection? For example the ops and tool categories are too identical. and I need a generic engineering category too. It would be so lovely to have a uniform look for our icons. Maybe some monochrome Heroku style kind of 16 pixel icons. So, if you feel you can help, contact me at <a href=\"mailto:mose@greenruby.org\">mose@greenruby.org</a>.","c":null},{"i":82,"d":"aug 31th 2014","e":"There was some much publications this week, it is harder and harder to make a selection. Also, I begin to have too long a list of podcasts and sometimes I can't listen to them all. Should I focus more? It would be annoying as I like eclecticism, in a certain range. Anyways, I'm happy to announce we almost have 500 subscribers by now, and more and more traffic on the website. You may laugh, but as I don't like google and their analytics/tracking, I use the good old webalizer for the <a href=\"http://greenruby.org/stats/\">Greenruby site stats</a>. So vintage! Maybe one day I will setup a piwik though.","c":null},{"i":83,"d":"sep 7th 2014","e":"This week there is some progress on the future version of Green Ruby website, you can check <a href=\"https://github.com/greenruby/grn-js\">https://github.com/greenruby/grn-js</a> if you are curious. And if you want to contribute, you are welcome to join us (just send a mail to <a href=\"mailto:mose@greenruby.org\">mose@greenruby.org</a>). Thanks Quentin, Greg, Jared, Xenor and Pooyan that already jumped in.","c":null},{"i":84,"d":"sep 14th 2014","e":"If you are not far from Denver in the US, you may need to know that this week there is the <a href=\"http://robots.thoughtbot.com/denver-startup-week\">Denver Startup Week</a> by Thoughtbot. I hope they will put some videos online.","c":null},{"i":85,"d":"sep 21th 2014","e":"There is some people every day on our <a href=\"http://webchat.freenode.net/?channels=%23greenruby\">irc channel</a>, but as I wanted to try <a href=\"http://slack.com\">slack</a> I opened a room there too (recent upgrades on hipchat were very annoying). <a href=\"mailto:mose@greenruby.org\">Poke me</a> if you want an invite to join it, for some chatting, or just if you want to see how slack works.","c":null},{"i":86,"d":"sep 28th 2014","e":"This is the week of <a href=\"http://bashsmash.ccsir.org/\">ShellShock</a>, as most of you already know, this is going to be a troubled time for old servers again (well, who still uses cgi scripts, right?). On a brighter side, I also went to <a href=\"http://eventifier.com/event/railspacific14/popular\">rails pacific</a> yesterday, it was nice to meet some Green Ruby subscribers there.","c":null},{"i":87,"d":"oct 5th 2014","e":"As there is a lot of new subscribers this week, let me remind you what this newsletter is.<br>I'm a french fullstack <a href=\"http://mose.com\">geek</a> living in Taiwan, ruby lover, and currently in a devops phase. I don't have much time to surf around during the week as I have a fulltime job. So every Sunday I dedicate 4 to 6 hours to sort my inbox, check stuff, track what's new, so I can remain current. <br>And then as I'm doing it for myself, well, I structured it a bit and sent my review to some friends. <a href=\"http://mailchimp.com\">Mailchimp</a> offers a free tier, the review is done already, why not share it to a wider audience. <a href=\"https://twitter.com/tubaxenor\">Xenor</a> sends me some links every week, as well as various other people now. Having more people reading it and appreciating this review helps me to stay motivated doing it every week. So, thanks for that.","c":null},{"i":88,"d":"oct 12th 2014","e":"If you understand japanese, check the <a href=\"http://www.youtube.com/watch?v=jLJvdMIoJs4\">presentation</a> of tenderlove at rubykaigi. Damn he's good.","c":null}]
